src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_ЯМ_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияОсновныхРеквизитов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСопоставление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)

	ЗаполнитьСопоставление();

КонецПроцедуры

&НаКлиенте
Процедура КатегорияОчистка(Элемент, СтандартнаяОбработка)

	ЗаполнитьСопоставление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеРеквизитыТовара

&НаКлиенте
Процедура Реквизит1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры"));
	Если ЕстьВидНоменклатурыУХарактеристики() Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
			"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры"));
	КонецЕсли;
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры"));

	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;
	Если ТекущаяСтрока.РеквизитТовара = "ДлинаУпаковки" Или ТекущаяСтрока.РеквизитТовара = "ШиринаУпаковки"
		Или ТекущаяСтрока.РеквизитТовара = "ВысотаУпаковки" Или ТекущаяСтрока.РеквизитТовара = "ВесУпаковки" Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
			"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение"));
	КонецЕсли;

	ДанныеВыбора = СписокВыбора;

КонецПроцедуры

&НаКлиенте
Процедура Реквизит1СОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;

	Если ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры") Тогда

		МассивЗначений = РеквизитыНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры") Тогда

		МассивЗначений = ДопРеквизитыНабора();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры") Тогда

		МассивЗначений = ДопСвойстваНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = НаборыДопРеквизитовХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры") Тогда

		МассивЗначений = ВидыНоменклатурыХарактеристик();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = РеквизитыХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение") Тогда

		ТекущаяСтрока.ВидРеквизита1С = ВыбранноеЗначение;
		ЗаписатьСопоставлениеОсновногоРеквизита();
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидРеквизита1С", ВыбранноеЗначение);

	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Реквизит1СОчистка(Элемент, СтандартнаяОбработка)

	УдалитьСопоставлениеОсновногоРеквизита();

КонецПроцедуры

&НаКлиенте
Процедура ФиксированноеЗначениеПриИзменении(Элемент)

	ЗаписатьСопоставлениеОсновногоРеквизита();

КонецПроцедуры

//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
&НаКлиенте
Процедура МножительПриИзменении(Элемент)
	ЗаписатьСопоставлениеОсновногоРеквизита();
КонецПроцедуры //- ИнфоСофт Заварин К.В. 20.05.24 УА #71157

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подсказка(Команда)

	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;

	Если ТекущаяСтрока <> Неопределено Тогда
		ТекстПодсказки = ТекущаяСтрока.РасширеннаяПодсказка;
		ПоказатьПредупреждение( , ТекстПодсказки, , "Укажите реквизит в котором хранится  """
			+ ТекущаяСтрока.ПредставлениеРеквизитаТовара + """");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСопоставление(Команда)

	УдалитьСопоставлениеОсновногоРеквизита();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыОповещения

&НаКлиенте
Процедура ВыборРеквизитаДляЗаполнения(Результат, СтруктураПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;

	Если ТипЗнч(Результат) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидРеквизита1С", СтруктураПараметров.ВидРеквизита1С);

		Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);

		МассивЗначений = ДопРеквизитыНабора(Результат);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

		ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ТекущаяСтрока.ВидРеквизита1С = СтруктураПараметров.ВидРеквизита1С;
		ТекущаяСтрока.Реквизит1С 	 = Результат;

	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Тогда
		ЗаписатьСопоставлениеОсновногоРеквизита();
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСопоставление()

	ОсновныеРеквизитыТовара.Очистить();
	ТЗ = ОсновныеРеквизитыТовара.Выгрузить();
	ТаблицаРеквизитов = ИС_ЯМ_Сервер.ЗаполнитьТаблицуОсновныхРеквизитов(ТЗ, Категория);

	ОсновныеРеквизитыТовара.Загрузить(ТаблицаРеквизитов);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВидНоменклатурыУХарактеристики()

	Возврат ИС_MP_ВыгрузкаКарточек.ЕстьВидНоменклатурыУХарактеристики();

КонецФункции

&НаКлиенте
Процедура УдалитьСопоставлениеОсновногоРеквизита()

	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УдалитьСопоставлениеОсновногоРеквизитаНаСервере(Категория, ТекущаяСтрока.РеквизитТовара, "ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара");

	ТекущаяСтрока.Реквизит1С 	 = Неопределено;
	ТекущаяСтрока.ВидРеквизита1С = ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");
	ТекущаяСтрока.ФиксированноеЗначение = 0;
	
	//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	ТекущаяСтрока.Множитель = 0;
	//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставлениеОсновногоРеквизита()
	
	ТекущаяСтрока = Элементы.ОсновныеРеквизитыТовара.ТекущиеДанные;
	
	//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	//Добавлен множитель
	ДобавитьСопоставлениеОсновногоРеквизита(Категория, ТекущаяСтрока.РеквизитТовара,
	ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С, ТекущаяСтрока.ФиксированноеЗначение, "ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара", ТекущаяСтрока.Множитель);
	//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	
КонецПроцедуры 

//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
//Добавлен множитель  
&НаСервере
Процедура ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение, ИмяРегистра, Множитель)	
	ИС_MP_ВыгрузкаКарточек.ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение, ИмяРегистра, Множитель); 
КонецПроцедуры  //- ИнфоСофт Заварин К.В. 20.05.24 УА #71157  

&НаСервере
Процедура УдалитьСопоставлениеОсновногоРеквизитаНаСервере(Категория, РеквизитТовара, ИмяРегистра)	
	ИС_MP_ВыгрузкаКарточек.УдалитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ИмяРегистра);
КонецПроцедуры  

&НаСервере
Функция ДопРеквизитыНабора(Результат = Неопределено)
	Возврат ИС_MP_ВыгрузкаКарточек.ДопРеквизитыНабора(Результат);
КонецФункции  

&НаСервере
Функция РеквизитыНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.РеквизитыНоменклатуры();
КонецФункции

&НаСервере
Функция ДопСвойстваНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.ДопСвойстваНоменклатуры();
КонецФункции

&НаСервере
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.НаборыДопРеквизитовХарактеристикиНоменклатуры();
КонецФункции

&НаСервере
Функция ВидыНоменклатурыХарактеристик()
	Возврат ИС_MP_ВыгрузкаКарточек.ВидыНоменклатурыХарактеристик();
КонецФункции

&НаСервере
Функция РеквизитыХарактеристикиНоменклатуры()
	Возврат ИС_MP_ВыгрузкаКарточек.РеквизитыХарактеристикиНоменклатуры();
КонецФункции

#КонецОбласти
